idRequest.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:pok="http://example.com/pokemon">
    <soapenv:Header />
    <soapenv:Body>
        <pok:GetIdRequest>
            <pok:name>pikachu</pok:name>
        </pok:GetIdRequest>
    </soapenv:Body>
</soapenv:Envelope>